app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-02-24 13:20:02.889043"], ["id", 1]]
---
  def update
    # raise params.inspect
    @article = find_by_id(params[:id])
    @article.update(title: params[:article][:title], description: params[:article][:description])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_by_id(id)
      @article = Article.find(id)